const russianBadWords = [
    // Прямые ругательства
    'блядь', 'блять', 'бля', 'сука', 'хуй', 'пиздец', 'дерьмо', 'говно', 'жопа',
    'мудак', 'ублюдок', 'сволочь', 'мразь', 'пидор', 'пидорас', 'шлюха',
    'хуесос', 'долбоёб', 'долбоеб', 'чмо', 'еблан', 'уёбище', 'уебан',
    'кретин', 'дебил', 'идиот', 'тупой', 'дурак', 'придурок', 'мудила',
    'скотина', 'гад', 'гадина', 'тварь', 'быдло', 'засранец', 'подонок',

    // Производные и словоформы
    'сукин', 'сучка', 'суки', 'хуйня', 'хуета', 'хуёвый', 'хуе', 'хуя',
    'пиздеж', 'пиздеть', 'пиздецки', 'пиздюлина', 'говна', 'говнюк',
    'жопу', 'жопе', 'мудака', 'мудаки', 'пидр', 'шлюшка', 'блядина',
    'ебаный', 'ебанутый', 'ебануться', 'ебало', 'ебалник', 'ебарь',
    'ебливая', 'долбоеба', 'чмошник', 'уебок', 'мудозвон', 'хуемразь',
    'ебанатик',

    // Действия и глаголы
    'ебать', 'ебаться', 'дрочить', 'дрочер', 'дрочеры', 'срать', 'засрать', 'отъебись',
    'отъебаться', 'похер', 'похуй', 'нахер', 'нахуй', 'похрен',

    // Сленг и выражения
    'фигня', 'хер', 'хрен', 'херня', 'херовый', 'залупа', 'срака', 'срань',
    'сраный', 'похабный', 'похабщина', 'похабство', 'похуизм', 'похеризм',
    'чёрт', 'гондон',
];

export default russianBadWords;